podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_MK28F15.svd.xml
            <register>
               <name>ERQ</name>
               <description>Enable Request Register</description>
               <addressOffset>0xC</addressOffset>
               <fields>
                  <field>
                     <name>ERQ0</name>
                     <description>Enable DMA Request 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The DMA request signal for the corresponding channel is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The DMA request signal for the corresponding channel is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="ERQ0" > <name>ERQ1</name> <description>Enable DMA Request 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ2</name> <description>Enable DMA Request 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ3</name> <description>Enable DMA Request 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ4</name> <description>Enable DMA Request 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ5</name> <description>Enable DMA Request 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ6</name> <description>Enable DMA Request 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ7</name> <description>Enable DMA Request 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ8</name> <description>Enable DMA Request 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ9</name> <description>Enable DMA Request 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ10</name> <description>Enable DMA Request 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ11</name> <description>Enable DMA Request 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ12</name> <description>Enable DMA Request 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ13</name> <description>Enable DMA Request 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ14</name> <description>Enable DMA Request 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ15</name> <description>Enable DMA Request 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ16</name> <description>Enable DMA Request 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ17</name> <description>Enable DMA Request 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ18</name> <description>Enable DMA Request 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ19</name> <description>Enable DMA Request 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ20</name> <description>Enable DMA Request 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ21</name> <description>Enable DMA Request 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ22</name> <description>Enable DMA Request 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ23</name> <description>Enable DMA Request 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ24</name> <description>Enable DMA Request 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ25</name> <description>Enable DMA Request 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ26</name> <description>Enable DMA Request 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ27</name> <description>Enable DMA Request 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ28</name> <description>Enable DMA Request 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ29</name> <description>Enable DMA Request 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ30</name> <description>Enable DMA Request 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="ERQ0" > <name>ERQ31</name> <description>Enable DMA Request 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>EEI</name>
               <description>Enable Error Interrupt Register\n
Contains a bit to enable or disable errors interrupts from each channel</description>
               <addressOffset>0x14</addressOffset>
               <fields>
                  <field>
                     <name>EEI0</name>
                     <description>Enable Error Interrupt 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupts disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupts enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="EEI0" > <name>EEI1</name> <description>Enable Error Interrupt 1</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI2</name> <description>Enable Error Interrupt 2</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI3</name> <description>Enable Error Interrupt 3</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI4</name> <description>Enable Error Interrupt 4</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI5</name> <description>Enable Error Interrupt 5</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI6</name> <description>Enable Error Interrupt 6</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI7</name> <description>Enable Error Interrupt 7</description> <bitOffset>7</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI8</name> <description>Enable Error Interrupt 8</description> <bitOffset>8</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI9</name> <description>Enable Error Interrupt 9</description> <bitOffset>9</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI10</name> <description>Enable Error Interrupt 10</description> <bitOffset>10</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI11</name> <description>Enable Error Interrupt 11</description> <bitOffset>11</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI12</name> <description>Enable Error Interrupt 12</description> <bitOffset>12</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI13</name> <description>Enable Error Interrupt 13</description> <bitOffset>13</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI14</name> <description>Enable Error Interrupt 14</description> <bitOffset>14</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI15</name> <description>Enable Error Interrupt 15</description> <bitOffset>15</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI16</name> <description>Enable Error Interrupt 16</description> <bitOffset>16</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI17</name> <description>Enable Error Interrupt 17</description> <bitOffset>17</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI18</name> <description>Enable Error Interrupt 18</description> <bitOffset>18</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI19</name> <description>Enable Error Interrupt 19</description> <bitOffset>19</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI20</name> <description>Enable Error Interrupt 20</description> <bitOffset>20</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI21</name> <description>Enable Error Interrupt 21</description> <bitOffset>21</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI22</name> <description>Enable Error Interrupt 22</description> <bitOffset>22</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI23</name> <description>Enable Error Interrupt 23</description> <bitOffset>23</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI24</name> <description>Enable Error Interrupt 24</description> <bitOffset>24</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI25</name> <description>Enable Error Interrupt 25</description> <bitOffset>25</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI26</name> <description>Enable Error Interrupt 26</description> <bitOffset>26</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI27</name> <description>Enable Error Interrupt 27</description> <bitOffset>27</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI28</name> <description>Enable Error Interrupt 28</description> <bitOffset>28</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI29</name> <description>Enable Error Interrupt 29</description> <bitOffset>29</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI30</name> <description>Enable Error Interrupt 30</description> <bitOffset>30</bitOffset> </field>
                  <field derivedFrom="EEI0" > <name>EEI31</name> <description>Enable Error Interrupt 31</description> <bitOffset>31</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>CEEI</name>
               <description>Clear Enable Error Interrupt Register</description>
               <addressOffset>0x18</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CEEI</name>
                     <description>Clear Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CAEE</name>
                     <description>Clear All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clear only the EEI bit specified in the CEEI field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clear all bits in EEI</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SEEI</name>
               <description>Set Enable Error Interrupt Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SEEI</name>
                     <description>Set Enable Error Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SAEE</name>
                     <description>Sets All Enable Error Interrupts</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Set only the EEI bit specified in the SEEI field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Sets all bits in EEI</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CERQ</name>
               <description>Clear Enable Request Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CERQ</name>
                     <description>Clear Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CAER</name>
                     <description>Clear All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clear only the ERQ bit specified in the CERQ field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clear all bits in ERQ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SERQ</name>
               <description>Set Enable Request Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SERQ</name>
                     <description>Set Enable Request</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>SAER</name>
                     <description>Set All Enable Requests</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Set only the ERQ bit specified in the SERQ field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Set all bits in ERQ</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CDNE</name>
               <description>Clear DONE Status Bit Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <access>write-only</access>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CDNE</name>
                     <description>Clear DONE Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>5</bitWidth>
                  </field>
                  <field>
                     <name>CADN</name>
                     <description>Clears All DONE Bits</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Clears only the TCDn_CSR[DONE] bit specified in the CDNE field</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Clears all bits in TCDn_CSR[DONE]</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NOP</name>
                     <description>No Op enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Normal operation</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>No operation, ignore the other bits in this register</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
