podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/DMA_MK28F15.svd.xml
               <register>
                  <name>NBYTES_MLOFFYES</name>
                  <description>TCD Signed Minor Loop Offset (Minor Loop Mapping and Offset Enabled)</description>
                  <addressOffset>0x8</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>NBYTES</name>
                        <description>Minor Byte Transfer Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>MLOFF</name>
                        <description>If SMLOE or DMLOE is set, this field represents a sign-extended offset applied to the source or destination address to form the next-state value after the minor loop completes</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>20</bitWidth>
                     </field>
                     <field>
                        <name>DMLOE</name>
                        <description>Destination Minor Loop Offset enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The minor loop offset is not applied to the DADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The minor loop offset is applied to the DADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SMLOE</name>
                        <description>Source Minor Loop Offset Enable</description>
                        <bitOffset>31</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The minor loop offset is not applied to the SADDR</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The minor loop offset is applied to the SADDR</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SLAST</name>
                  <description>TCD Last Source Address Adjustment</description>
                  <addressOffset>0xC</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>SLAST</name>
                        <description>Last Source Address Adjustment</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DADDR</name>
                  <description>TCD Destination Address</description>
                  <addressOffset>0x10</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DADDR</name>
                        <description>Destination Address</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DOFF</name>
                  <description>TCD Signed Destination Address Offset</description>
                  <addressOffset>0x14</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DOFF</name>
                        <description>Destination Address Signed Offset</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CITER_ELINKNO</name>
                  <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>CITER</name>
                        <description>Current Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enable channel-to-channel linking on minor-loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CITER_ELINKYES</name>
                  <description>TCD Current Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
                  <addressOffset>0x16</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>CITER</name>
                        <description>Current Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>LINKCH</name>
                        <description>Minor Loop Link Channel Number</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enable channel-to-channel linking on minor-loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DLASTSGA</name>
                  <description>TCD Last Destination Address Adjustment/Scatter Gather Address</description>
                  <addressOffset>0x18</addressOffset>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>DLASTSGA</name>
                        <description>Destination last address adjustment or the memory address for the next transfer control descriptor to be loaded into this channel (scatter/gather)</description>
                        <bitOffset>0</bitOffset>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CSR</name>
                  <description>TCD Control and Status</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>START</name>
                        <description>Channel Start</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel is not explicitly started</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel is explicitly started via a software initiated service request</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INTMAJOR</name>
                        <description>Enable an interrupt when major iteration count completes</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The end-of-major loop interrupt is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The end-of-major loop interrupt is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INTHALF</name>
                        <description>Enable an interrupt when major counter is half complete</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The half-point interrupt is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The half-point interrupt is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DREQ</name>
                        <description>Disable Request</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel&apos;s ERQ bit is not affected</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel&apos;s ERQ bit is cleared when the major loop is complete</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ESG</name>
                        <description>Enable Scatter/Gather Processing</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The current channel&apos;s TCD is normal format</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The current channel&apos;s TCD specifies a scatter gather format. The DLASTSGA field provides a memory pointer to the next TCD to be loaded into this channel after the major loop completes its execution</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MAJORELINK</name>
                        <description>Enable channel-to-channel linking on major loop complete</description>
                        <bitOffset>5</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>ACTIVE</name>
                        <description>Channel Active</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <access>read-only</access>
                     </field>
                     <field>
                        <name>DONE</name>
                        <description>Channel Done</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MAJORLINKCH</name>
                        <description>Major Loop Link Channel Number</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>BWC</name>
                        <description>Bandwidth Control</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b00</name>
                              <description>No eDMA engine stalls</description>
                              <value>0b00</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b10</name>
                              <description>eDMA engine stalls for 4 cycles after each R/W</description>
                              <value>0b10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b11</name>
                              <description>eDMA engine stalls for 8 cycles after each R/W</description>
                              <value>0b11</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BITER_ELINKNO</name>
                  <description>TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Disabled)</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>BITER</name>
                        <description>Starting Major Iteration Count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>15</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enables channel-to-channel linking on minor loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>BITER_ELINKYES</name>
                  <description>TCD Beginning Minor Loop Link, Major Loop Count (Channel Linking Enabled)</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <resetMask>0x0</resetMask>
                  <fields>
                     <field>
                        <name>BITER</name>
                        <description>Starting major iteration count</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>LINKCH</name>
                        <description>Link Channel Number</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>5</bitWidth>
                     </field>
                     <field>
                        <name>ELINK</name>
                        <description>Enables channel-to-channel linking on minor loop complete</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <enumeratedValue>
                              <name>0b0</name>
                              <description>The channel-to-channel linking is disabled</description>
                              <value>0b0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>0b1</name>
                              <description>The channel-to-channel linking is enabled</description>
                              <value>0b1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
         </registers>
      </peripheral>
